// @future 服务器获取

export const faqData = [
  {
    id: 1,
    title: '为什么一定要管理员权限启动',
    content: [
      {
        type: 'text',
        value:
          '目前一梦江湖PC版（非Mumu模拟器）是由管理员权限启动的，如果软件不以管理员权限运行，脚本则无法在游戏中运行。',
      },
    ],
  },
  {
    id: 2,
    title: '软件会趁机收集我的隐私吗',
    content: [
      {
        type: 'text',
        value:
          '不会，开发者拿你隐私又没什么用，而且软件已经开源在了github（包括前后端代码），链接可以去专栏查看。',
      },
      {
        type: 'text',
        value:
          '如果你还是怀疑开发者编译好分发的软件带后台，可以自行下载服务器与客户端源代码进行搭建与编译。',
      },
    ],
  },
  {
    id: 3,
    title: '为什么曲子更新这么慢',
    content: [
      {
        type: 'text',
        value:
          '_(:з」∠)_这个······开发者更新曲子比较随缘，大部分情况都是好友和用户问开发者做谱才会去做，如果你有什么想做的谱子可以在专栏留言或者私信（但是找不到简谱的话开发者可能做不了），当然如果你自己做好了字母谱想来分享给其他用户也是强烈欢迎的。',
      },
    ],
  },
  {
    id: 4,
    title: '软件以后会收费吗',
    content: [
      {
        type: 'text',
        value:
          '不会，目前主要花销是后台云服务器费用与域名地址费用，开支来讲不算大，开发者可以维持住。',
      },
      {
        type: 'text',
        value:
          '什么？你说觉得软件做的不错？一定想投喂？那太好了，客官请点这里(´･ω･`)q ',
      },
      {
        type: 'link',
        value: '投喂',
        href: 'https://www.bilibili.com/video/BV1GJ411x7h7',
      },
    ],
  },
  {
    id: 5,
    title: '发现了软件的bug',
    content: [
      {
        type: 'text',
        value:
          '快点联系我！快点联系我！快点联系我！快点联系我！快点联系我！快点联系我！快点联系我！',
      },
      {
        type: 'strong',
        value: '我让你快点联系我！',
      },
    ],
  },
];
